tylertms/Opentec/source/podium-dd1-dd2-base/source/platform/dspic33e/usb.c
/**
 * @brief Applies the enumerated USB device address.
 *
 * Writes the low seven address bits to the controller.
 *
 * @param[in] address Host-assigned device address.
 */
void platform_usb_set_address(uint8_t address) { U1ADDR = address & 0x7f; }

/**
 * @brief Configures a non-control USB endpoint.
 *
 * Enables handshake processing and the selected device-to-host and host-to-device transfer
 * directions while disabling control transfers on the endpoint.
 *
 * @param[in] endpoint Endpoint number from 1 through 4.
 * @param[in] input True to enable device-to-host transfers.
 * @param[in] output True to enable host-to-device transfers.
 */
void platform_usb_configure_endpoint(uint8_t endpoint, bool input, bool output) {
    if (endpoint == 0 || endpoint >= USB_ENDPOINT_COUNT) {
        return;
    }
    uint16_t control = USB_ENDPOINT_HANDSHAKE | USB_ENDPOINT_CONTROL_DISABLE;
    if (input) {
        control |= USB_ENDPOINT_TRANSMIT;
    }
    if (output) {
        control |= USB_ENDPOINT_RECEIVE;
    }
    volatile uint16_t *endpoint_control = &U1EP0 + endpoint;
    *endpoint_control = control;
}

/**
 * @brief Unconfigures a non-control USB endpoint.
 *
 * Disables the endpoint, clears both directions and banks, and resets its next-bank selection.
 *
 * @param[in] endpoint Endpoint number from 1 through 4.
 */
void platform_usb_unconfigure_endpoint(uint8_t endpoint) {
    if (endpoint == 0 || endpoint >= USB_ENDPOINT_COUNT) {
        return;
    }
    bool interrupt_enabled = IEC5bits.USB1IE != 0;
    IEC5bits.USB1IE = 0;
    volatile uint16_t *endpoint_control = &U1EP0 + endpoint;
    *endpoint_control = 0;
    for (uint8_t direction = 0; direction < USB_DIRECTION_COUNT; direction++) {
        for (uint8_t bank = 0; bank < USB_BANK_COUNT; bank++) {
            usb_buffer_descriptor_clear(descriptor(endpoint, direction != 0, bank != 0));
        }
        next_bank[endpoint][direction] = 0;
    }
    IEC5bits.USB1IE = interrupt_enabled;
}

/**
 * @brief Stalls one USB endpoint.
 *
 * Keeps endpoint zero able to accept a replacement setup packet, requests a stall handshake, and
 * releases token processing after the stall path is ready.
 *
 * @param[in] endpoint Endpoint number from zero through four.
 */
void platform_usb_stall(uint8_t endpoint) {
    if (endpoint < USB_ENDPOINT_COUNT) {
        bool interrupt_enabled = IEC5bits.USB1IE != 0;
        IEC5bits.USB1IE = 0;
        if (endpoint == 0) {
            clear_sof_recovery();
            uint8_t output_bank = next_bank[0][0];
            volatile UsbBufferDescriptor *output = descriptor(0, false, output_bank != 0);
            usb_buffer_descriptor_arm(output, buffer_address(0, false, output_bank != 0),
                                      PLATFORM_USB_PACKET_SIZE, false, true);
            output->status =
                USB_BUFFER_STALL | USB_BUFFER_DATA_TOGGLE_ENABLED | USB_BUFFER_OWNED_BY_USB;
            volatile UsbBufferDescriptor *input = descriptor(0, true, next_bank[0][1] != 0);
            input->status = USB_BUFFER_STALL | USB_BUFFER_OWNED_BY_USB;
        }
        volatile uint16_t *endpoint_control = &U1EP0 + endpoint;
        *endpoint_control |= USB_ENDPOINT_STALL;
        if (endpoint == 0) {
            U1CONbits.PKTDIS = 0;
        }
        IEC5bits.USB1IE = interrupt_enabled;
    }
}

/**
 * @brief Arms the endpoint-zero terminal input STALL.
 *
 * Publishes STALL and controller ownership on the selected endpoint-zero input descriptor without
 * changing the already armed output status stage or endpoint control state.
 */
void platform_usb_control_stall_input(void) {
    bool interrupt_enabled = IEC5bits.USB1IE != 0;
    IEC5bits.USB1IE = 0;
    bool odd_bank = next_bank[0][1] != 0;
    volatile UsbBufferDescriptor *input = descriptor(0, true, odd_bank);
    input->count = 0;
    input->status = USB_BUFFER_STALL | USB_BUFFER_OWNED_BY_USB;
    IEC5bits.USB1IE = interrupt_enabled;
}

/**
 * @brief Reports the halt state of one USB endpoint direction.
 *
 * Selects the current ping-pong descriptor from the endpoint address and reports a halt only while
 * that descriptor is stalled and controller-owned.
 *
 * @param[in] endpoint_address Endpoint number with bit seven set for device-to-host direction.
 * @return True when the selected endpoint direction is halted; otherwise false.
 */
bool platform_usb_endpoint_halted(uint8_t endpoint_address) {
    uint8_t endpoint = endpoint_address & USB_ENDPOINT_NUMBER_MASK;
    if ((endpoint_address & USB_ENDPOINT_ADDRESS_RESERVED_MASK) != 0 ||
        endpoint >= USB_ENDPOINT_COUNT) {
        return false;
    }
    bool input = (endpoint_address & USB_ENDPOINT_DIRECTION_IN) != 0;
    uint8_t direction = input ? 1 : 0;
    return usb_buffer_descriptor_halted(
        descriptor(endpoint, input, next_bank[endpoint][direction] != 0));
}

/**
 * @brief Changes the halt state of one non-control USB endpoint direction.
 *
 * A set operation presents a stall on both banks. A clear operation releases both banks,
 * restores DATA0/DATA1 ordering, and clears the endpoint stall latch while preserving the other
 * direction's configuration.
 *
 * @param[in] endpoint_address Endpoint number with bit seven set for device-to-host direction.
 * @param[in] halted True to set the halt; false to clear it.
 */
void platform_usb_set_endpoint_halt(uint8_t endpoint_address, bool halted) {
    uint8_t endpoint = endpoint_address & USB_ENDPOINT_NUMBER_MASK;
    if ((endpoint_address & USB_ENDPOINT_ADDRESS_RESERVED_MASK) != 0 || endpoint == 0 ||
        endpoint >= USB_ENDPOINT_COUNT) {
        return;
    }

    bool interrupt_enabled = IEC5bits.USB1IE != 0;
    IEC5bits.USB1IE = 0;
    bool input = (endpoint_address & USB_ENDPOINT_DIRECTION_IN) != 0;
    uint8_t direction = input ? 1 : 0;
    bool odd_bank = next_bank[endpoint][direction] != 0;
    volatile UsbBufferDescriptor *selected = descriptor(endpoint, input, odd_bank);
    if (halted) {
        usb_buffer_descriptor_set_halt(selected);
        usb_buffer_descriptor_set_halt(descriptor(endpoint, input, !odd_bank));
    } else {
        usb_buffer_descriptor_clear_halt(selected, descriptor(endpoint, input, !odd_bank));
        volatile uint16_t *endpoint_control = &U1EP0 + endpoint;
        *endpoint_control &= (uint16_t)~USB_ENDPOINT_STALL;
    }
    IEC5bits.USB1IE = interrupt_enabled;
}

#ifdef OPENTEC_SIMULATOR_TEST
uint16_t platform_usb_test_descriptor_status(uint8_t endpoint, bool input, bool odd_bank) {
    return endpoint < USB_ENDPOINT_COUNT ? descriptor(endpoint, input, odd_bank)->status : 0;
}

uint16_t platform_usb_test_descriptor_count(uint8_t endpoint, bool input, bool odd_bank) {
    return endpoint < USB_ENDPOINT_COUNT ? descriptor(endpoint, input, odd_bank)->count : 0;
}

