tylertms/Opentec/source/podium-dd1-dd2-base/source/platform/dspic33e/usb.c
void platform_usb_test_set_descriptor(uint8_t endpoint, bool input, bool odd_bank, uint16_t status,
                                      uint16_t count) {
    if (endpoint < USB_ENDPOINT_COUNT) {
        volatile UsbBufferDescriptor *target = descriptor(endpoint, input, odd_bank);
        target->status = status;
        target->count = count;
    }
}
#endif

/**
 * @brief Captures one completed USB transaction.
 *
 * Decodes endpoint, direction, and ping-pong bank from controller status, advances the bank
 * selector, and queues the completed setup, output, or input-completion event. Setup traffic clears
 * a prior control stall but remains token-gated until its next stage is armed.
 *
 */
static void handle_transaction(uint8_t status) {
    uint8_t endpoint = (status & USB_TRANSACTION_ENDPOINT_MASK) >> 4;
    bool input = (status & USB_TRANSACTION_INPUT) != 0;
    bool odd_bank = (status & USB_TRANSACTION_ODD_BANK) != 0;
    if (endpoint >= USB_ENDPOINT_COUNT) {
        return;
    }
    next_bank[endpoint][input ? 1 : 0] = odd_bank ? 0 : 1;
    if (endpoint == 0) {
        sof_recovery_endpoint = endpoint;
        sof_recovery_input = input;
        sof_recovery_frames = USB_SOF_RECOVERY_FRAME_COUNT;
        sof_recovery_pending = true;
    }
    volatile UsbBufferDescriptor *completed = descriptor(endpoint, input, odd_bank);
    uint8_t length = (uint8_t)usb_buffer_descriptor_count(completed);

    if (input) {
        push_event(PLATFORM_USB_EVENT_IN_COMPLETE, endpoint, odd_bank, 0);
        return;
    }

    if (endpoint == 0) {
        control_out_current_bank = odd_bank;
    }
    PlatformUsbEventType type = usb_buffer_descriptor_packet_id(completed) == USB_PACKET_ID_SETUP
                                    ? PLATFORM_USB_EVENT_SETUP
                                    : PLATFORM_USB_EVENT_OUT;
    push_event(type, endpoint, odd_bank, length);
    if (type == PLATFORM_USB_EVENT_SETUP) {
        U1EP0bits.EPSTALL = 0;
    }
}

/**
 * @brief Services USB device-controller interrupts.
 *
 * Acknowledges activity with a whole-register U1OTGIR write and an ACTVIE read-modify-write, and
 * acknowledges idle with an ACTVIE read-modify-write and a whole-register U1IR write. Neither
 * source changes the controller suspend state. Reset, suspend, protocol errors, frame, stall, and
 * up to four queued transaction events are then handled before clearing the CPU interrupt request.
 *
 */
void __attribute__((interrupt, no_auto_psv)) _USB1Interrupt(void) {
    if (U1OTGIRbits.ACTVIF != 0 && U1OTGIEbits.ACTVIE != 0) {
        U1OTGIR = USB_OTG_ACTIVITY_INTERRUPT;
        U1OTGIEbits.ACTVIE = 0;
    }
    if (U1PWRCbits.USUSPEND != 0) {
        IFS5bits.USB1IF = 0;
        return;
    }
    if (U1IRbits.URSTIF != 0 && (U1IE & USB_INTERRUPT_RESET) != 0) {
        reset_controller();
        IEC5bits.USB1IE = 1;
        push_event(PLATFORM_USB_EVENT_RESET, 0, false, 0);
        U1IR = USB_INTERRUPT_RESET;
    }
    if (U1IRbits.IDLEIF != 0 && (U1IE & USB_INTERRUPT_IDLE) != 0) {
        U1OTGIEbits.ACTVIE = 1;
        U1IR = USB_INTERRUPT_IDLE;
        push_event(PLATFORM_USB_EVENT_SUSPEND, 0, false, 0);
    }
    if (U1IRbits.UERRIF != 0 && (U1IE & USB_INTERRUPT_ERROR) != 0) {
        U1EIR = 0xff;
        U1IR = USB_INTERRUPT_ERROR;
    }
    if (U1IRbits.SOFIF != 0 && (U1IE & USB_INTERRUPT_SOF) != 0) {
        U1IR = USB_INTERRUPT_SOF;
        handle_start_of_frame();
    }
    if (U1IRbits.STALLIF != 0 && (U1IE & USB_INTERRUPT_STALL) != 0) {
        if (U1EP0bits.EPSTALL != 0) {
            volatile UsbBufferDescriptor *output =
                descriptor(0, false, control_out_current_bank != 0);
            volatile UsbBufferDescriptor *input = descriptor(0, true, next_bank[0][1] != 0);
            if (output->status == USB_BUFFER_OWNED_BY_USB &&
                input->status == (USB_BUFFER_STALL | USB_BUFFER_OWNED_BY_USB)) {
                output->status =
                    USB_BUFFER_STALL | USB_BUFFER_DATA_TOGGLE_ENABLED | USB_BUFFER_OWNED_BY_USB;
                output->count = (uint16_t)(output->count & 0x00ff);
            }
            U1EP0bits.EPSTALL = 0;
        }
        U1IR = USB_INTERRUPT_STALL;
    }
    for (uint8_t transaction = 0;
         transaction < 4 && U1IRbits.TRNIF != 0 && (U1IE & USB_INTERRUPT_TRANSACTION) != 0;
         transaction++) {
        handle_transaction(U1STAT);
        U1IR = USB_INTERRUPT_TRANSACTION;
    }
    IFS5bits.USB1IF = 0;
}

#ifdef OPENTEC_SIMULATOR_TEST
/**
 * @brief Services a synthetic bus-reset source for platform tests.
 *
 * Runs the production bus-reset restoration sequence and leaves the CPU USB interrupt enabled as
 * the interrupt handler does after resetting the controller.
 */
void platform_usb_test_service_reset(void) {
    reset_controller();
    IEC5bits.USB1IE = 1;
}

/**
 * @brief Services a synthetic transaction-complete source for platform tests.
 *
 * The simulator models U1STAT and U1IR as hardware-owned registers, so tests inject their decoded
 * values through this production-path helper while retaining the real U1IE gate.
 *
 * @param[in] status Synthetic U1STAT endpoint, direction, and bank value.
 */
void platform_usb_test_service_transaction(uint8_t status) {
    if ((U1IE & USB_INTERRUPT_TRANSACTION) != 0) {
        handle_transaction(status);
    }
}

/**
 * @brief Services a synthetic start-of-frame source for platform tests.
 *
 * @return None.
 */
void platform_usb_test_service_sof(void) {
    if ((U1IE & USB_INTERRUPT_SOF) != 0) {
        handle_start_of_frame();
    }
}

#endif
